nxp-mcuxpresso/mcux-soc-svd/MCXA536/MCXA536.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="LPSPI2">
      <name>LPSPI0</name>
      <description>Low-Power Serial Peripheral Interface</description>
      <groupName>LPSPI</groupName>
      <baseAddress>0x4009C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPSPI0</name>
        <value>28</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPSPI2">
      <name>LPSPI1</name>
      <description>Low-Power Serial Peripheral Interface</description>
      <groupName>LPSPI</groupName>
      <baseAddress>0x4009D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LPSPI1</name>
        <value>29</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>T1S0</name>
      <description>TENBASET_PHY</description>
      <groupName>T1S</groupName>
      <baseAddress>0x4002D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TENBASET_PHY0</name>
        <value>93</value>
      </interrupt>
      <registers>
        <register>
          <name>PHYCTRL</name>
          <description>PHY control</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>SPD1</name>
              <description>Speed Selection1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTEST</name>
              <description>Collision Test</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUPLX</name>
              <description>Duplex Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPD0</name>
              <description>Speed Selection0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESET</name>
              <description>RESET</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHYSTAT</name>
          <description>PHY status</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>LJAB</name>
              <description>Local Jabber</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RJAB</name>
              <description>Remote Jabber</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHYID0</name>
          <description>PHY Identifier0</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x1B</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OUI_03_18</name>
              <description>Organizationally Unique Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHYID1</name>
          <description>PHY Identifier1</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0xB040</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ICREVISION</name>
              <description>IC Model Revision</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ICMODEL</name>
              <description>IC Model Identifier</description>
              <bitOffset>4</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUI_19_24</name>
              <description>Organizationally Unique Identifier</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASE1EXT</name>
          <description>PHY BASE-T1 Extended</description>
          <addressOffset>0x44</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BASET1EXT_BIT</name>
              <description>Capability Info</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMAPMDCTRL</name>
          <description>PMA/PMD Control</description>
          <addressOffset>0x68</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TYPE</name>
              <description>Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBT1</name>
                  <description>CBT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBT1</name>
                  <description>MBT1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XBT1L</name>
                  <description>XBT1L</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XBT1S</name>
                  <description>XBT1S</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PMACTRL</name>
          <description>PMA CTRL</description>
          <addressOffset>0x92</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8400</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>LOOP</name>
              <description>Loop</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOOPDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOPEN</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULT</name>
              <description>Multidrop Configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXDIS</name>
              <description>Transmission Disable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXDIS</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXEN</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST</name>
              <description>Reset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMASTAT</name>
          <description>PMA Status</description>
          <addressOffset>0x94</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x2E00</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RJAB</name>
              <description>RJAB Alias</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RFLTA</name>
              <description>Receive Fault Advertises</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULTA</name>
              <description>Multidrop Advertises</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPWA</name>
              <description>Low Power Advertise</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOOPA</name>
              <description>Loopback Advertise</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMATM</name>
          <description>PMA Test Mode</description>
          <addressOffset>0x96</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PATTERN</name>
              <description>Pattern</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>NONE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TM1</name>
                  <description>TM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TM2</name>
                  <description>TM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TM3</name>
                  <description>TM3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TM4</name>
                  <description>TM4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES0</name>
                  <description>RES0</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES1</name>
                  <description>RES1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WUT</name>
                  <description>WUT</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCSCTRL</name>
          <description>PCS Control</description>
          <addressOffset>0xA6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8100</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DUPLX</name>
              <description>Duplex</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOOP</name>
              <description>Loop</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LD</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LE</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST</name>
              <description>Reset</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STAT_NO_RESET</name>
                  <description>STAT_NO_RESET</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STAT_RESET</name>
                  <description>STAT_RESET</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCSSTAT</name>
          <description>PCS Status</description>
          <addressOffset>0xA8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>JAB</name>
              <description>Jabber condition</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JABNO</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JABYES</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PCSDIAG1</name>
          <description>PCS Remote Jabber Counter</description>
          <addressOffset>0xAA</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>REMJABCNT</name>
              <description>Remote Jabber Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCSDIAG2</name>
          <description>PCS Physical Collisions Counter</description>
          <addressOffset>0xAC</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PHYCOLCNT</name>
              <description>Physical Collisions Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLCAIDVER</name>
          <description>PLCA Identification and Version</description>
          <addressOffset>0xC0</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0xA11</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>VER</name>
              <description>Version</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDM</name>
              <description>OA memory map identifier</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLCACTRL0</name>
          <description>PLCA Control0</description>
          <addressOffset>0xC2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RST</name>
              <description>Reset</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLCACTRL1</name>
          <description>PLCA Control1</description>
          <addressOffset>0xC4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8FF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ID</name>
              <description>Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NCNT</name>
              <description>PLCA Node count</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLCASTAT</name>
          <description>PLCA Status</description>
          <addressOffset>0xC6</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PST</name>
              <description>PLCA Node status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLCATOTMR</name>
          <description>PLCA Transmit Opportunity Timer</description>
          <addressOffset>0xC8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>TOTMR</name>
              <description>PLCA Transmit Opportunity</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLCABURST</name>
          <description>PLCA Burst Mode Configuration</description>
          <addressOffset>0xCA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>BTMR</name>
              <description>Burst Timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAXBC</name>
              <description>Maximum Burst Count</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLCARECST</name>
          <description>PLCA Status</description>
          <addressOffset>0xCC</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>RECST</name>
              <description>Recovering Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
