nxp-mcuxpresso/mcux-soc-svd/MCXA536/MCXA536.xml
        <register>
          <name>OSC2_CTL</name>
          <description>TRNG Oscillator 2 Control Register</description>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRNG_ENT_CTL</name>
              <description>TRNG entropy generation control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRNG_ENT_CTL_SINGLE_OSC1</name>
                  <description>Single oscillator mode, using OSC1 (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRNG_ENT_CTL_DUAL_OSCS</name>
                  <description>Dual oscillator mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRNG_ENT_CTL_SINGLE_OSC2</name>
                  <description>Single oscillator mode, using OSC2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC2_DIV_DIV8</name>
                  <description>Unused, (bit field cannot be written to this value)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC2_DIV</name>
              <description>Oscillator 2 Divide.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC2_DIV_DIV1</name>
                  <description>Use ring oscillator 2 with no divide</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC2_DIV_DIV2</name>
                  <description>Use ring oscillator 2 divided-by-2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC2_DIV_DIV4</name>
                  <description>Use ring oscillator 2 divided-by-4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC2_DIV_DIV8</name>
                  <description>Use ring oscillator 2 divided-by-8</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC2_FCT_VAL</name>
              <description>TRNG Oscillator 2 Frequency Count Valid</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Frequency count is invalid.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>If TRNG_ENT_CTL = 10b, valid frequency count may be read from OSC2_FRQCNT.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_FAILSAFE_LMT</name>
              <description>Oscillator fail safe limit.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC_FAILSAFE_LMT_4K</name>
                  <description>The limit N is 4096 (2^12) system clocks.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_FAILSAFE_LMT_64K</name>
                  <description>The limit N is 65536 (2^16) system clocks. (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_FAILSAFE_LMT_1M</name>
                  <description>N is 2^20 system clocks.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_FAILSAFE_LMT_4M</name>
                  <description>N is 2^22 system clocks (full range of the counter being used).</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_FAILSAFE_TEST</name>
              <description>Oscillator fail safe test.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No impact.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Disables oscillator 2 while in dual-oscillator mode (TRNG_ENT_CTL = 01b).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VID1</name>
          <description>Version ID Register (MS)</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x30140C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MIN_REV</name>
              <description>Shows the IP's Minor revision of the TRNG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIN_REV_VAL</name>
                  <description>Minor revision number for TRNG.</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAJ_REV</name>
              <description>Shows the IP's Major revision of the TRNG</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAJ_REV_VAL</name>
                  <description>Major revision number for TRNG.</description>
                  <value>0x14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IP_ID</name>
              <description>Shows the IP ID.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IP_ID_VAL</name>
                  <description>ID for TRNG.</description>
                  <value>0x30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VID2</name>
          <description>Version ID Register (LS)</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xC0A0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CONFIG_OPT</name>
              <description>Shows the IP's Configuaration options for the TRNG.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONFIG_OPT_VAL</name>
                  <description>TRNG_CONFIG_OPT for TRNG.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECO_REV</name>
              <description>Shows the IP's ECO revision of the TRNG.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECO_REV_VAL</name>
                  <description>TRNG_ECO_REV for TRNG.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTG_OPT</name>
              <description>Shows the integration options for the TRNG.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTG_OPT_VAL</name>
                  <description>INTG_OPT for TRNG.</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERA</name>
              <description>Shows the ERA of the TRNG.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERA_VAL</name>
                  <description>ERA of the TRNG.</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
